In [4]:
import pandas as pd

In [5]:
# 열 이름을 key, 리스트를 value로 갖는 딕셔너리의 정의 (2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
#리스트에 행인덱스 열 이름을 지정하여 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                  index =['준서','예은'],
                  columns = ['나이', '성별', '학교'])
#행 인덱스, 열이름 확인하기
print(df)
print(df.index) #인덱스 이름
print(df.columns) #열 이름

    나이 성별   학교
준서  15  남  신촌중
예은  17  여  연세중
Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [7]:
df.columns = ['연령','남여','소속']

In [8]:
df

    연령 남여   소속
준서  15  남  신촌중
예은  17  여  연세중

In [9]:
#메소드를 사용해서 행과 열이름 변경
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                  index =['준서','예은'],
                  columns = ['나이', '성별', '학교'])
df.rename(columns={'나이':'연령', '성별':'남여',
                   '학교':'소속'}, inplace=True)

In [10]:
df

    연령 남여   소속
준서  15  남  신촌중
예은  17  여  연세중

In [11]:
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)

In [12]:
df

     연령 남여   소속
학생1  15  남  신촌중
학생2  17  여  연세중

In [13]:
data = {'국어':[80, 90, 70, 30], '영어':[90, 70, 60, 40],
        '수학':[90,60,80,70]}
#춘향, 몽룡, 향단, 방자
df = pd.DataFrame(data, index={'춘향':'0', '몽룡':'1', 
                               '향단':'2', '방자':'3'})
print(df)

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [14]:
#indexing으로 몽룡의 국어점수 뽑아보기
# df[columns][index] ([열][인덱스])
df['국어']['몽룡']

90

In [15]:
# numpy random.randint를 사용해서 60~100 사이 12개 숫자를 만들고
# reshape하고 index가 James, maria, brian, alice를 만들고
# 컬럼 이름은 kor, eng, math로 된 데이터 프레임을 생성하기
import numpy as np
np.random.seed(2023)
df = pd.DataFrame(np.random.randint(60, 100, 12).reshape(4,3),
                 index=['James', 'Maria', 'Brian', 'Alice'],
                 columns=['kor', 'eng', 'math'])
df

       kor  eng  math
James   83   85    66
Maria   93   88    63
Brian   82   97    92
Alice   82   77    73

In [24]:
%%writefile sample.csv
c1, c2, c3
1, 1.15, one
2, 2.23, two
3, 3.32, three

Overwriting sample.csv

In [48]:
# 파일로 읽을때
df = pd.read_csv('sample.csv')

In [49]:
#행삭제를 위해서 df2에 복사
df2 = df[:]

In [50]:
#1개 행삭제
df2.drop(1, inplace=True)

C:\Users\tjoeun\AppData\Local\Temp\ipykernel_1680\1468631767.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(1, inplace=True)

In [53]:
df3 = pd.DataFrame(np.random.randint(60, 100, 12).reshape(4,3),
                 index=['James', 'Maria', 'Brian', 'Alice'],
                 columns=['kor', 'eng', 'math'])
df3

       kor  eng  math
James   78   65    89
Maria   75   86    93
Brian   62   68    86
Alice   82   96    84

In [54]:
df3.drop('Brian')

       kor  eng  math
James   78   65    89
Maria   75   86    93
Alice   82   96    84

In [55]:
df3.drop(['James', 'Alice'], axis=0, inplace=True)
df3

       kor  eng  math
Maria   75   86    93
Brian   62   68    86

In [58]:
#열삭제
df4 = pd.DataFrame(np.random.randint(60, 100, 16).reshape(4,4),
                 index=['James', 'Maria', 'Brian', 'Alice'],
                 columns=['kor', 'eng', 'math', 'music'])
df4

       kor  eng  math  music
James   91   80    63     80
Maria   72   66    97     96
Brian   79   93    78     63
Alice   85   70    81     74

In [64]:
df5 = df4.copy()
df5

       kor  eng  math  music
James   91   80    63     80
Maria   72   66    97     96
Brian   79   93    78     63
Alice   85   70    81     74

In [65]:
df5.drop('math', axis=1, inplace=True)
df5

       kor  eng  music
James   91   80     80
Maria   72   66     96
Brian   79   93     63
Alice   85   70     74

In [81]:
df6 = df4.copy()
df6

       kor  eng  math  music
James   91   80    63     80
Maria   72   66    97     96
Brian   79   93    78     63
Alice   85   70    81     74

In [82]:
df6.drop(['eng','music'], axis =1, inplace=True)
df6

       kor  math
James   91    63
Maria   72    97
Brian   79    78
Alice   85    81

In [86]:
# select row
# row index를 사용하여 행 1개를 선택
mar1 = df4.loc['Maria'] #location
print(mar1)

kor      72
eng      66
math     97
music    96
Name: Maria, dtype: int32

In [88]:
mar2 = df4.iloc[1]# imter location
print(mar2)

kor      72
eng      66
math     97
music    96
Name: Maria, dtype: int32

In [90]:
label =df4.loc[['Brian','Alice']]
label2 = df4.iloc[2,3]
label2

63

In [95]:
# 슬라이싱은 [[A,B]] 대신 [A:B]를 사용한다.
# 범위를 지정하여 행 선택
label2 = df4.loc[['Maria', 'Brian']]
label3 = df4.loc['Maria':'Brian']

In [96]:
print(label2)
print(label3)

       kor  eng  math  music
Maria   72   66    97     96
Brian   79   93    78     63
       kor  eng  math  music
Maria   72   66    97     96
Brian   79   93    78     63

In [98]:
label4 = df4.iloc[[1, 2]]
label5 = df4.iloc[1:3]
print(label4)
print(label5)

       kor  eng  math  music
Maria   72   66    97     96
Brian   79   93    78     63
       kor  eng  math  music
Maria   72   66    97     96
Brian   79   93    78     63

In [101]:
# select columns
math1 = df4['math']
print(type(math1))
print(math1)

<class 'pandas.core.series.Series'>
James    63
Maria    97
Brian    78
Alice    81
Name: math, dtype: int32

In [104]:
# 영어 컬럼 선택
eng1 = df4.eng
print(type(eng1))
print(eng1)

<class 'pandas.core.series.Series'>
James    80
Maria    66
Brian    93
Alice    70
Name: eng, dtype: int32

In [105]:
math_music = df4[['math','music']]
print(type(math_music))
print(math_music)

<class 'pandas.core.frame.DataFrame'>
       math  music
James    63     80
Maria    97     96
Brian    78     63
Alice    81     74

In [108]:
math2 = df4[['math']]
print(type(math2))
print(math2)

<class 'pandas.core.frame.DataFrame'>
       math
James    63
Maria    97
Brian    78
Alice    81

In [115]:
# select elements
# Maria 음악점수 가져오기
# df4.loc['Maria', 'music'] # df.loc[행, 열]
df4.iloc[1,3]

96

In [112]:
df4

       kor  eng  math  music
James   91   80    63     80
Maria   72   66    97     96
Brian   79   93    78     63
Alice   85   70    81     74

In [117]:
#df4.loc['Maria', ['eng', 'math']]
df4.iloc[1,[1,2]]

eng     66
math    97
Name: Maria, dtype: int32

In [118]:
df4

       kor  eng  math  music
James   91   80    63     80
Maria   72   66    97     96
Brian   79   93    78     63
Alice   85   70    81     74

In [120]:
# James의 영어 수학 음악점수 가져오기 loc와 iloc모두 사용
df4.loc['James',['eng','math','music']]

eng      80
math     63
music    80
Name: James, dtype: int32

In [121]:
df4.iloc[0,[1,2,3]]

eng      80
math     63
music    80
Name: James, dtype: int32

In [136]:
# Maria ~ Alice, eng ~ music까지 loc iloc 사용
df4.loc['Maria':'Alice', 'eng':'music']

       eng  math  music
Maria   66    97     96
Brian   93    78     63
Alice   70    81     74

In [135]:
df4.iloc[1:4, 1:4]

       eng  math  music
Maria   66    97     96
Brian   93    78     63
Alice   70    81     74

In [138]:
# 열 추가 add columns
df4['gym'] = 90 # 없으면 생성 있으면 수정
df4

       kor  eng  math  music  gym
James   91   80    63     80   90
Maria   72   66    97     96   90
Brian   79   93    78     63   90
Alice   85   70    81     74   90

In [139]:
# 행 추가
df4.loc[4] = 0
df4

       kor  eng  math  music  gym
James   91   80    63     80   90
Maria   72   66    97     96   90
Brian   79   93    78     63   90
Alice   85   70    81     74   90
4        0    0     0      0    0

In [142]:
df4.loc['gildong'] = [ 90, 70, 60, 75, 60]
df4

         kor  eng  math  music  gym
James     91   80    63     80   90
Maria     72   66    97     96   90
Brian     79   93    78     63   90
Alice     85   70    81     74   90
4          0    0     0      0    0
gildong   90   70    60     75   60

In [144]:
df4.loc[4] = [ 90, 70, 60, 75, 60]
df4

         kor  eng  math  music  gym
James     91   80    63     80   90
Maria     72   66    97     96   90
Brian     79   93    78     63   90
Alice     85   70    81     74   90
4         90   70    60     75   60
gildong   90   70    60     75   60

In [145]:
df5 = df4.copy()
df5 = df5.reindex(index=['James', 'Maria', 'Gildong', 'Brian', 'Alice', 4])

In [146]:
df5

          kor   eng  math  music   gym
James    91.0  80.0  63.0   80.0  90.0
Maria    72.0  66.0  97.0   96.0  90.0
Gildong   NaN   NaN   NaN    NaN   NaN
Brian    79.0  93.0  78.0   63.0  90.0
Alice    85.0  70.0  81.0   74.0  90.0
4        90.0  70.0  60.0   75.0  60.0

In [148]:
# set_index
exam_data = {'이름': ['길동','철수', '영희'],
             '수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [149]:
df.set_index('이름', inplace=True)
print(df)

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [150]:
# 길동의 체육점수
# df.iloc[0][3]
# df.loc['길동', '체육']

In [153]:
# 길동의 체육점수 90점으로 수정
df.loc['길동','체육'] =90
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   95  90
영희  70  95  100  90

In [160]:
# 철수 음악 체육을 50점으로 변경
# 철수의 음악 체육을 100, 50으로 변경
df.loc['철수',['음악','체육']] = 50

In [161]:
df

    수학  영어   음악  체육  음악체육
이름
길동  90  98   85  90   NaN
철수  80  89   50  50  50.0
영희  70  95  100  90   NaN

In [165]:
df.loc['철수',['음악','체육']] = 100,50
df

    수학  영어   음악  체육  음악체육
이름
길동  90  98   85  90   NaN
철수  80  89  100  50  50.0
영희  70  95  100  90   NaN

In [168]:
df = df.T
df

이름      길동     철수     영희
수학    90.0   80.0   70.0
영어    98.0   89.0   95.0
음악    85.0  100.0  100.0
체육    90.0   50.0   90.0
음악체육   NaN   50.0    NaN

In [171]:
#reindex
dict_data = {'c0':[1,2,3], 'c1':[4,5,6],
             'c2':[7,8,9], 'c3':[10,11,12]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3
r0   1   4   7  10
r1   2   5   8  11
r2   3   6   9  12

In [173]:
#인덱스를 새로 지정해서 행 추가함
new_index = ['r0', 'r1', 'r2', 'r3','r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3
r0  1.0  4.0  7.0  10.0
r1  2.0  5.0  8.0  11.0
r2  3.0  6.0  9.0  12.0
r3  NaN  NaN  NaN   NaN
r4  NaN  NaN  NaN   NaN

In [174]:
# reindex로 발생한 NAN값을 0으로 채우기
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3
r0   1   4   7  10
r1   2   5   8  11
r2   3   6   9  12
r3   0   0   0   0
r4   0   0   0   0

In [175]:
# reset_index
ndf2 = ndf2.reset_index()

In [177]:
ndf2

  index  c0  c1  c2  c3
0    r0   1   4   7  10
1    r1   2   5   8  11
2    r2   3   6   9  12
3    r3   0   0   0   0
4    r4   0   0   0   0

In [178]:
# 내림차순으로 행 인덱스 정렬
ndf2 = ndf2.sort_index(ascending=False)
print(ndf2)

  index  c0  c1  c2  c3
4    r4   0   0   0   0
3    r3   0   0   0   0
2    r2   3   6   9  12
1    r1   2   5   8  11
0    r0   1   4   7  10

In [181]:
# 열을 c1열을 기준으로 내림차순
ndf3 = ndf2.sort_values(by='c1', ascending=False)
print(ndf3)

  index  c0  c1  c2  c3
2    r2   3   6   9  12
1    r1   2   5   8  11
0    r0   1   4   7  10
4    r4   0   0   0   0
3    r3   0   0   0   0

In [185]:
# 시리즈 숫자계산
student = pd.Series(dict(국어=100, 영어=80, 수학=90))
student

국어    100
영어     80
수학     90
dtype: int64

In [186]:
#과목별로 점수를 200으로 나누기
percentage = student/200
print(percentage)
print(type(percentage))

국어    0.50
영어    0.40
수학    0.45
dtype: float64
<class 'pandas.core.series.Series'>

In [189]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add1 = student1 + student2 # 덧셈
sub1 = student1 - student2 # 뺄셈
mul1 = student1 * student2 # 곱셈
div1 = student1 / student2 # 나눗셈
print(add1, sub, mul, div)

국어    190
수학    170
영어    160
dtype: int64 국어    10
수학    10
영어     0
dtype: int64 국어    9000
수학    7200
영어    6400
dtype: int64 국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [191]:
#사칙연산 결과를 데이터 프레임으로 합치기 (series, -->데이터프레임)
result = pd.DataFrame([add1, sub1, mul1, div1], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [195]:
# 결측치가 있는경우 사칙연산
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add2 = student1 + student2 # 덧셈
sub2 = student1 - student2 # 뺄셈
mul2 = student1 * student2 # 곱셈
div2 = student1 / student2 # 나눗셈
print(add2, sub2, mul2, div2)

국어      NaN
수학    170.0
영어    160.0
dtype: float64 국어     NaN
수학    10.0
영어     0.0
dtype: float64 국어       NaN
수학    7200.0
영어    6400.0
dtype: float64 국어      NaN
수학    1.125
영어    1.000
dtype: float64

In [196]:
result = pd.DataFrame([add2, sub2, mul2, div2], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

     국어        수학      영어
덧셈  NaN   170.000   160.0
뺄셈  NaN    10.000     0.0
곱셈  NaN  7200.000  6400.0
나눗셈 NaN     1.125     1.0

In [197]:
# 두 학생의 과목별 점수 사칙연산(연산메소드 사용)
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add3 = student1.add(student2, fill_value=0) # 덧셈
sub3 = student1.sub(student2, fill_value=0) # 뺄셈
mul3 = student1.mul(student2, fill_value=0) # 곱셈
div3 = student1.div(student2, fill_value=0) # 나눗셈
print(add3, sub3, mul3, div3)

국어     90.0
수학    170.0
영어    160.0
dtype: float64 국어   -90.0
수학    10.0
영어     0.0
dtype: float64 국어       0.0
수학    7200.0
영어    6400.0
dtype: float64 국어    0.000
수학    1.125
영어    1.000
dtype: float64

In [200]:
# 타이타닉 데이터셋에서
import seaborn as sns
titanic = sns.load_dataset('titanic')
len('titanic')

7

In [201]:
titanic.head() # 첫 5개 행만 출력

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [205]:
df = titanic.loc[:, ['age','fare']]

In [207]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [209]:
new_df = df + 10
new_df

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [211]:
# 데이터 프레임끼리 연산
new_df - df

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]